{
    "app_name": "SFSDK",
    "sf_menu_user": "Me",
    "sf_menu_account": "Account",
    "sf_menu_orders": "Charge",
    "sf_menu_news": "News",
    "sf_menu_pack": "Pack",
    "sf_menu_support": "Support",
    "sf_social_email": "Email",
    "sf_social_huawei": "HuaWei",
    "sf_social_google": "Google",
    "sf_social_games": "Play Games",
    "sf_social_facebook": "Facebook",
    "sf_login_countdown": "(s)",
    "sf_action_copy": "Copy",
    "sf_action_check": "Check",
    "sf_action_next": "Continue",
    "sf_action_send": "Send",
    "sf_action_submit": "Submit",
    "sf_action_reset": "Reset",
    "sf_action_login": "Sign in",
    "sf_action_register": "Sign up",
    "sf_action_confirm": "Confirm",
    "sf_action_cancel": "Cancel",
    "sf_action_ok": "Confirm",
    "sf_action_return": "Return",
    "sf_action_receive": "Receive",
    "sf_previous_page": "Previous page",
    "sf_next_page": "Next page",
    "sf_copy_success": "Copy successfully",
    "sf_login_welcome": ", welcome",
    "sf_data_empty_tips": "No data yet",
    "sf_account_bind_tips": "It is recommended to bind the account as soon as possible to prevent data loss",
    "sf_and_joiner": " and ",
    "sf_not_init": "Sdk init not called",
    "sf_init_failed": "Sdk init failed",
    "sf_protocol_title": "Agreement",
    "sf_protocol_agree": "Agree",
    "sf_protocol_refuse": "Exit",
    "sf_protocol_desc": "Thank you for using this game. You should carefully read and agree to the  and .",
    "sf_protocol_desc2": "Please click \\\"Agree\\\" to start accepting our services.",
    "sf_protocol_user": "User Service Agreement",
    "sf_protocol_privacy": "User Privacy Agreement",
    "sf_link_title": "Link account",
    "sf_link_with_huawei": "Link with HUAWEI",
    "sf_link_with_google": "Link with Google",
    "sf_link_with_games": "Link with Play Games",
    "sf_link_with_facebook": "Link with Facebook",
    "sf_link_with_email": "Link with Email",
    "sf_link_done_huawei": "Linked HUAWEI Account",
    "sf_link_done_google": "Linked Google Account",
    "sf_link_done_games": "Linked Play Games Account",
    "sf_link_done_facebook": "Linked Facebook Account",
    "sf_link_done_email": "Linked Email Account",
    "sf_unlink_title": "UnLink account",
    "sf_unlink_account": "UnLink ",
    "sf_unlink_success": "UnLink success",
    "sf_user_center": "User Center",
    "sf_user_contact": "Contact",
    "sf_user_account": "Account",
    "sf_user_gamer_community": "Gamer Community",
    "sf_user_customer_service": "Customer Service",
    "sf_user_link_account": "Link Account",
    "sf_user_switch_account": "Switch Account",
    "sf_user_delete_account": "Account Cancellation",
    "sf_user_upgrade_account": "Account Upgrade",
    "sf_user_contact_service": "Contact Customer Service",
    "sf_user_privacy_policy": "Privacy Policy",
    "sf_user_recharge_order": "Recharge Order",
    "sf_user_questionnaire": "Questionnaire",
    "sf_user_not_login": "User is not logged in, please sign in first",
    "sf_user_account_id": "Account ID:",
    "sf_user_account_number": "Account:",
    "sf_game_community_facebook": "Facebook",
    "sf_game_community_discord": "Discord",
    "sf_game_community_instagram": "Instagram",
    "sf_game_community_twitter": "Twitter",
    "sf_game_community_line": "LINE",
    "sf_login_title": "Sign in",
    "sf_login_with_huawei": "Sign in with HUAWEI",
    "sf_login_with_google": "Sign in with Google",
    "sf_login_with_games": "Sign in with Play Games",
    "sf_login_with_facebook": "Sign in with Facebook",
    "sf_login_with_visitor": "Sign in as a Visitor",
    "sf_login_with_email": "Sign in with Email account",
    "sf_login_back_social": "Sign in with social media account",
    "sf_login_back_email": "Already have an account? Sign in",
    "sf_login_type_not_support": "Current login type is not support",
    "sf_login_history_usual": "Usual",
    "sf_login_history_time": "Last login:",
    "sf_login_time_minute": " minute ago",
    "sf_login_time_minutes": " minutes ago",
    "sf_login_time_hour": " hour ago",
    "sf_login_time_hours": " hours ago",
    "sf_login_time_day": " day ago",
    "sf_login_time_days": " days ago",
    "sf_login_other_types": "Other Login Methods",
    "sf_email_login_title": "Sign in with Email",
    "sf_email_signup_title": "Sign up with Email",
    "sf_verify_countdown": " s",
    "sf_hint_account": "Please enter your account",
    "sf_hint_account_check": "The account number is a combination of 6–20 letters and numbers.",
    "sf_hint_account_empty": "Please enter your account",
    "sf_hint_email": "Please enter email address",
    "sf_hint_email_check": "The E-mail format is incorrect",
    "sf_hint_password": "Please enter your password",
    "sf_hint_password_new": "Please enter your new password",
    "sf_hint_password_check": "The password is a combination of 6–20 letters and numbers.",
    "sf_hint_verify_code": "Verification code",
    "sf_hint_email_code": "Please enter verification code",
    "sf_forget_account": "Forgot account",
    "sf_forget_password": "Forgot password",
    "sf_reset_password_back": "Don't have an account? Sign up",
    "sf_reset_password_title": "Reset Password",
    "sf_reset_password_desc": "Please enter the account number and bound email address to reset the password",
    "sf_find_account_desc": "Please enter the email address bound to the account to retrieve the account",
    "sf_find_account_tips": "Please keep your account to avoid losing it",
    "sf_find_account_login": "Copy account and log in",
    "sf_visitor_title": "TIPS",
    "sf_visitor_content": "You are currently logged in as a visitor, to avoid loss of game data, we suggest that you link your account immediately.",
    "sf_visitor_btn_ignore": "Ignore",
    "sf_email_bind_title": "Link email account",
    "sf_visitor_upgrade_btn": "Continue",
    "sf_visitor_upgrade_cancel": "Cancel? Go back",
    "sf_paying_tip": "A payment is processing. Please try again later",
    "sf_pay_checking": "Payment is currently being checked. Please try again later",
    "sf_pay_failed": "Payment failed",
    "sf_owned_order_check": "We have detected that your last payment was not completed. Do you want to continue to complete the last payment?",
    "sf_owned_order_checked": "Payment completed",
    "sf_owned_order_checked_failed": "Payment recover failed",
    "sf_pending_order_checked": "We detected that you have an order in payment for this product, but we have not received the \"SUCCESS STATUS\" notification from google service. If you have completed the payment, it may be caused by the delay of the third-party payment channel. Please don't worry. When we receive the \"SUCCESS STATUS\" notification from google service, we will distribute the corresponding products for you. ",
    "sf_pending_order_checked_normal": "We have received the \"PENDING STATUS\" notification from google service for this product. If you have completed the payment, it may be caused by the delay of the third-party payment channel. Please don't worry. When we receive the \"SUCCESS STATUS\" notification from google service, we will distribute the corresponding products for you. ",
    "sf_email_not_empty": "Please enter your email",
    "sf_password_not_empty": "Please enter your password",
    "sf_code_not_empty": "Please enter the verification code",
    "sf_email_sent": "Verify code send successfully",
    "sf_loading": "Loading, please wait…",
    "sf_email_code_tip": "Please enter the email code we have send to your email address",
    "sf_register_failed": "Register new account failed",
    "sf_reset_password_failed": "Reset password failed",
    "sf_reset_password_success": "Your password has been reset, please login",
    "sf_link_failed": "Account binding failed",
    "sf_facebook_not_installed": "Facebook not installed, please log in with other methods",
    "sf_create_order_failed": "Create order failed",
    "sf_pay_closed": "Payment now is closed, please retry later",
    "sf_update_title": "Update Tip",
    "sf_update_content_force": "A new version [] is available. \nBecause some required features have been updated, you must update to the latest version if you want to continue",
    "sf_update_content": "A new version [] is available. \nFor a better experience, we recommend that you update to the latest version",
    "sf_update_ok": "Update",
    "sf_update_cancel": "Cancel",
    "sf_update_url_error": "The update url is null or empty",
    "sf_web_location_tips": " wants to use your device's location information",
    "sf_cancel_account_title": "Account Cancellation",
    "sf_cancel_account_desc": "The account cancellation function needs to be performed when your current game character is offline. After clicking Confirm, you will log out and go to account cancellation center. Are you sure you want to log out and cancel your account?",
    "sf_cancel_account_warn_tips": "If the account is canceled, the game data will be cleared, please operate with caution",
    "sf_account_protocol_prefix": "I have read and agree to ",
    "sf_account_protocol_check": "Please read and agree to ",
    "sf_cancel_account_protocol": "\"Game Account Cancellation Agreement\"",
    "sf_cancel_account_protocol_check": "Please agree the deletion agreement first",
    "sf_cancel_account_conditions_title": "Cancellation Conditions",
    "sf_cancel_account_conditions_content": "Dear players, we regret your cancellation. In order to ensure the safety of your account and property, please ensure that the following conditions are met before the application submitted. Our team also has the right to verify according to the situation:\n1. The account is in safe state: Please make sure your account is in normal use, not in the period of violation processing, and there is no risk of being stolen or blocked;\n2. Game revenue has been settled or properly handled: including but not limited to game tokens, other game virtual items and other game value-added services (hereinafter collectively referred to as \"game revenue\"). Please handle it properly. If you do not handle it, it will be deemed that you voluntarily give up the game revenue;\n3. The account has no outstanding status orders: including recharging game tokens, purchasing other game virtual items and other peripheral goods, etc.\n4. If there is an in-game community creator identity, intimacy, and other interactive relationships: Please ensure that these social relationships are removed (creation of in-game communities requires the removal of the creator identity).\n5. There are no disputes in the account: including complaints and reports, arbitration, litigation and other disputes.",
    "sf_cancel_account_conditions_meet": "I have met the above cancellation conditions",
    "sf_cancel_account_agreement_title": "Account Cancellation Agreement",
    "sf_cancel_account_agreement_content": "Dear players, before you officially start the next step of the game account cancellation process, please be sure to read and agree to the \"Game Account Cancellation Agreement\" (hereinafter referred to as \"Agreement\"). If you check this agreement and click \"Continue\": it is deemed that you have agreed to and abide by the entire content of this agreement. We specifically remind you that:\nIf you successfully submit your account cancellation application, we will keep the account for 15 days from the day you submit. During this period, we will not delete the relevant information of the account (for example, your friends can still see your avatar, nickname and other account information). If you use this account to log in to this game during this period, it will be deemed that you have cancelled the account cancellation application. After 15 Days from your application, we will complete the account cancellation, delete or anonymize your relevant personal information.\nAfter canceling this game account, your game account will be deleted or anonymized, and you will no longer be able to retrieve, access, obtain, continue to use and recover it, and you have no right to request us to retrieve personal information, which includes but is not limited to: avatar, nickname, all game virtual items purchased or obtained in the game and other value-added services, speech, region, in-game chat records, etc.\nFor other detailed rules and precautions for game account cancellation, please click to view the \"Game Account Cancellation Agreement\".",
    "sf_cancel_account_protocol_title": "Account Cancellation Agreement",
    "sf_cancel_account_protocol_content": "Before you cancel your account, please read carefully and agree to the followings:\n[Special Reminder] Successfully canceling this account is an irrecoverable operation. You will no longer be able to use this account or retrieve any game-related content you browse or bind, even if you use the same mobile phone number, email or other third-party account to register again.\nIt is recommended that you back up all information related to your account before your cancellation, and please confirm that all services related to this account have been properly handled. After the cancellation is completed, we will delete or anonymize your personal information (unless otherwise provided by laws and regulations).\n\n1. We deeply regret your decision to cancel your account. If you still decide to proceed with account cancellation, your account must meet the following conditions:\n1.1. The account is in a safe state: the account is in normal use, and there is no risk of being stolen after the platform security check.\n1.2. Account property has been settled, and there are no uncompleted or disputed services: there are no assets, arrears, unsettled funds and virtual rights in the account. There are no uncompleted or Controversial service.\n1.3. Account permission removed: The account has been released from the third-party product, web page authorized login or binding relationship.\n1.4. The account does not have any outstanding disputes, including complaints and reports or being reported by complaints.\n\n2. After the account is cancelled, you will not be able to log in or use the account, nor will you be able to recover any content or information related to the account, including but not limited to:\n2.1. Personal identity information, account information, game-related data and other information submitted by individuals.\n2.2. Records related to third-party services used through this account, authorized to log in or bound to this account will not be recovered. You will no longer be able to log in and use the above-mentioned services, and property interests such as assets or virtual rights that you have obtained through the above-mentioned services will be deemed as your agreement to give up and will not be able to continue to be used. You understand and agree that we cannot assist you in restoring the above services.\n2.3 The wallet account balance, rewards, income, real-name authentication information, transaction records, bound bank cards and other information in the account will be invalidated and deleted.\n\n3. Account cancellation will result in our termination of services to you, which are in accordance with the rights and obligations of User Service Agreement and Privacy Policy.\n\n4. During the cancellation of your account, if your account is involved in disputes, including but not limited to: complaints, reports, lawsuits, arbitrations, investigations by state agencies, etc., we have the right to decide whether to terminate the account cancellation.\n\n5. The cancellation of this account does not mean that the account behavior and related responsibilities before the cancellation of this account are forgiven or mitigated.",
    "sf_cancel_account_agreement_agree": "I have read and agree to the ",
    "sf_cancel_account_notice_title": "Cancellation Notice",
    "sf_cancel_account_notice_content": "In order to prevent commiseration, please re-confirm whether to cancel the account and confirm the impact, which includes but not limited to \"Game Account Cancellation Agreement\":\n1. Once the account is cancelled, you will not be able to log in and use this game account, which cannot be recovered. Unless otherwise stipulated by laws and regulations or the game account cancellation agreement, the personal information under the game account will be deleted or anonymize. You will no longer be able to retrieve your personal information and have no right to ask us to do so.\n2. Once the account is cancelled, the game tokens, other game virtual items and value-added services (hereinafter collectively referred to as \"game revenue\") under the account will also be cleared. Accordingly, we also remind you that before you cancel your game account, please ensure that the game revenue under the game account has been properly handled or the related game revenue has been settled. Once you cancel the game account, it will be deemed that you voluntarily gave up the game income, and we have the right to clear all the game income under the game account, so you shall be responsible for the consequences.",
    "sf_cancel_account_notice_giveup": "Give Up",
    "sf_cancel_account_notice_agree": "Agree to Cancel",
    "sf_cancel_account_success_title": "Application Submitted",
    "sf_cancel_account_success_content": "Thank you for your support. Your account's cancellation application has been successfully submitted at . Except for the provisions of laws and the cancellation agreement, we will keep the account for you until  (15 days from the day after you submit the cancellation application). After that, the account cancellation application will take effect, and we will delete or anonymize your relevant personal information.<br><br><font color=\"#ff4332\">Before the expiration of the aforementioned 15 days, please do not log in and use this account to ensure the smooth completion of the cancellation, otherwise you will be deemed to have withdrawn the cancellation application.</font>",
    "sf_refund_warning_tips": "Dear player, our system has detected that there has been a refund made on your account. Refunding is considered a serious violation according to our user agreement. Multiple refunds on this account will result in a permanent ban.",
    "sf_account_unbind_disallow_tips": "Please complete the account upgrade or bind other accounts before unbinding",
    "sf_question_instruction": "Questionnaire instructions:",
    "sf_question_select_role": "Please select a role",
    "sf_question_select_server": "Please select a server",
    "sf_question_check_undone": "The question has not been answered yet, please finish it before submitting.",
    "sf_question_action_start": "Start Answering Questions",
    "sf_question_action_submit": "Submit Questionnaire",
    "sf_question_action_receive": "Receive",
    "sf_question_action_return": "Return to Game",
    "sf_question_state_over": "The event is over",
    "sf_order_id": "Order ID",
    "sf_order_server": "Server",
    "sf_order_role": "Role",
    "sf_order_amount": "Amount",
    "sf_order_empty": "No order record",
    "sf_gift_exchange": "Exchange Method:",
    "sf_gift_receive_success": "Received successfully",
    "sf_gift_receive_failed": "Failed to receive",
    "sf_error_domain_failed": "No domain name available",
    "sf_error_parse_failed": "Response parse failed",
    "sf_error_network_error": "Currently the network is not available. Please check your network connection.",
    "sf_error_data_exception": "Data is abnormal, please try again later",
    "sf_error_params_invalid": "Invalid parameter, please check and try again",
    "sf_error_login_closed": "Login now is closed, please retry later",
    "sf_error_login_canceled": "Login canceled",
    "sf_error_1001": "The game does not exist",
    "sf_error_1002": "Incorrect account or password",
    "sf_error_1003": "This user has been banned",
    "sf_error_1004": "Visitor login is closed",
    "sf_error_1005": "The maximum number of visitor logins has been reached",
    "sf_error_1006": "Login failed",
    "sf_error_1007": "Email address does not exist",
    "sf_error_1008": "Email address already used",
    "sf_error_1009": "The verification code is incorrect or has expired",
    "sf_error_1010": "Email address binding failed",
    "sf_error_1011": "Account already used",
    "sf_error_1012": "Account binding failed",
    "sf_error_1013": "Game recharge function is closed",
    "sf_error_1014": "Game product does not exist",
    "sf_error_1015": "Game product price is incorrect",
    "sf_error_1016": "The order does not exist",
    "sf_error_1017": "The order verification failed",
    "sf_error_1018": "Please wait for review",
    "sf_error_1019": "The interval between two cancellation applications needs to be greater than 3 days",
    "sf_error_1020": "There are orders in progress in your account, and you cannot apply for account cancellation at this time.",
    "sf_error_1023": "Dear player, your account has been banned due to frequent refund activities, please click the button below to contact our official customer service if you need to be unblocked.",
    "sf_error_1028": "This account has not been registered yet. Do you want to register this account?",
    "sf_error_1029": "This account already has a game character and cannot be bound. Please change the account.",
    "sf_error_1030": "This account has not been registered yet. Do you want to register this account and then use this account to upgrade?",
    "sf_error_1031": "UnLink failed",
    "sf_error_1032": "The account does not exist",
    "sf_error_2000": "Success",
    "sf_error_2001": "Payment failed",
    "sf_error_2002": "The request has reached the maximum timeout before Google Play responds",
    "sf_error_2003": "The requested feature is not supported by the Play Store on the current device",
    "sf_error_2004": "The app is not connected to the Play Store service via the Google Play Billing Library",
    "sf_error_2005": "Transaction was canceled by the user",
    "sf_error_2006": "The service is currently unavailable",
    "sf_error_2007": "A user billing error occurred during processing",
    "sf_error_2008": "The requested product is not available for purchase",
    "sf_error_2009": "Error resulting from incorrect usage of the API",
    "sf_error_2010": "Fatal error during the API action",
    "sf_error_2011": "The purchase failed because the item is already owned",
    "sf_error_2012": "Requested action on the item failed since it is not owned by the user",
    "sf_error_2013": "No pre-registration order information found",
    "other": {
        "no_other_login_history_currently": "No other historical login information currently",
        "questionnaire_completed": "QuestionNAIRE_completed ",
        "submitted_successfully": "Submit successfully",
        "logout_success": "Logout success",
        "unbind_facebook": "Unbind Facebook",
        "unbind_google": "Unbind Google",
        "last_login_time": "Last login time",
        "sf_cancel_account_success_content_1": "Thank you for your support. Your account's cancellation application has been successfully submitted at ",
        "sf_cancel_account_success_content_2": " .Except for the provisions of laws and the cancellation agreement, we will keep the account for you until ",
        "sf_cancel_account_success_content_3": " (15 days from the day after you submit the cancellation application). After that, the account cancellation application will take effect, and we will delete or anonymize your relevant personal information.<br><br><font color=\"#ff4332\">Before the expiration of the aforementioned 15 days, please do not log in and use this account to ensure the smooth completion of the cancellation, otherwise you will be deemed to have withdrawn the cancellation application.</font>",
        "sf_and_joiner": "and",
        "showMoney": "Payment Amount",
        "TH": "Thailand",
        "SG": "Singapore",
        "MY": "Malaysia",
        "PH": "Philippines",
        "ID": "Indonesia",
        "VN": "Vietnam",
        "HK": "Hong Kong",
        "TW": "Taiwan",
        "MO": "Macao",
        "US": "United States",
        "CA": "Canada",
        "AU": "Australia",
        "GB": "United Kingdom",
        "FR": "France",
        "DE": "Germany",
        "submit_pay": "Confirm Payment",
        "select_country_list": "Please select country",
        "select_country": "Switch to other country channels (optional)",
        "pay_dialog_text": "This payment has not been completed yet, please confirm whether to exit?",
        "pay_quit_text": "Confirm exit",
        "pay_continue_text": "Continue to pay",
        "sf_link_with_apple": "Link with Apple",
        "sf_link_done_apple": "Linked Apple Account",
        "sf_third_cancel": "Cancelled"
    }
}