{
    "sf_menu_user": "สมาชิก",
    "sf_menu_account": "บัญชี",
    "sf_menu_orders": "เติมเงิน",
    "sf_menu_news": "ข่าวสาร",
    "sf_menu_pack": "แพ็ก",
    "sf_menu_support": "บริการลูกค้า",
    "sf_social_email": "กล่องจดหมาย",
    "sf_social_huawei": "HUAWEI",
    "sf_action_copy": "คัดลอก",
    "sf_action_check": "ตรวจสอบ",
    "sf_action_next": "ถัดไป",
    "sf_action_send": "ส่ง",
    "sf_action_submit": "ส่ง",
    "sf_action_reset": "รีเซ็ต",
    "sf_action_login": "เข้าสู่ระบบ",
    "sf_action_register": "ลงทะเบียน",
    "sf_action_confirm": "ยืนยัน",
    "sf_action_cancel": "ยกเลิก",
    "sf_action_ok": "ยืนยัน",
    "sf_action_return": "กลับ",
    "sf_action_receive": "รับ",
    "sf_previous_page": "ก่อนหน้า",
    "sf_next_page": "หน้าถัดไป",
    "sf_copy_success": "คัดลอกสำเร็จ",
    "sf_login_welcome": "%s ยินดีต้อนรับ",
    "sf_data_empty_tips": "ยังไม่มีข้อมูลในขณะนี้",
    "sf_account_bind_tips": "ขอแนะนำให้ท่านผูกบัญชีโดยเร็วที่สุดเพื่อป้องกันการสูญเสียข้อมูล",
    "sf_and_joiner": " และ ",
    "sf_not_init": "การเริ่มต้น SDK ไม่ได้เรียก",
    "sf_init_failed": "การเริ่มต้น SDK ล้มเหลว",
    "sf_protocol_title": "ข้อตกลงความเป็นส่วนตัว",
    "sf_protocol_agree": "ยินยอม",
    "sf_protocol_refuse": "ออก",
    "sf_protocol_desc": "ขอขอบคุณทุกท่านที่ใช้บริการเกมนี้ โปรดอ่านอย่างละเอียดและยอมรับ  และ  ก่อนเข้าเกม",
    "sf_protocol_desc2": "กรุณาคลิก “ตกลง“ เพื่อยอมรับการบริการของทางเรา",
    "sf_protocol_user": "ข้อตกลงการใช้บริการของผู้ใช้",
    "sf_protocol_privacy": "ข้อตกลงความเป็นส่วนตัวของผู้ใช้",
    "sf_link_title": "ผูกบัญชี",
    "sf_link_with_huawei": "ผูกบัญชี HUAWEI",
    "sf_link_with_google": "ผูกบัญชี Google",
    "sf_link_with_games": "ผูกบัญชี Play Games",
    "sf_link_with_facebook": "ผูกบัญชี Facebook",
    "sf_link_with_email": "ผูกบัญชีอีเมล",
    "sf_link_done_huawei": "บัญชี HUAWEI ที่ถูกผูกไว้",
    "sf_link_done_google": "บัญชี Google ที่ถูกผูกไว้",
    "sf_link_done_games": "บัญชี Play Games ที่ถูกผูกไว้",
    "sf_link_done_facebook": "บัญชี Facebook ที่ถูกผูกไว้",
    "sf_link_done_email": "บัญชีอีเมลที่ถูกผูกไว้",
    "sf_unlink_title": "ยกเลิกการผูก",
    "sf_unlink_account": "ยกเลิกการผูก%s",
    "sf_unlink_success": "ยกเลิกการผูกสำเร็จ",
    "sf_user_center": "ศูนย์ผู้ใช้",
    "sf_user_contact": "ติดต่อ",
    "sf_user_account": "บัญชี",
    "sf_user_gamer_community": "ชุมชนผู้เล่น",
    "sf_user_customer_service": "การบริการลูกค้า",
    "sf_user_link_account": "การผูกบัญชี",
    "sf_user_switch_account": "การสลับบัญชี",
    "sf_user_delete_account": "ลบบัญชี",
    "sf_user_upgrade_account": "อัปเกรดบัญชี",
    "sf_user_contact_service": "ติดต่อบริการลูกค้า",
    "sf_user_privacy_policy": "นโยบายความเป็นส่วนตัว",
    "sf_user_recharge_order": "การสั่งซื้อ",
    "sf_user_questionnaire": "แบบสอบถาม",
    "sf_user_not_login": "ผู้ใช้ยังไม่ได้เข้าสู่ระบบ กรุณาเข้าสู่ระบบก่อน",
    "sf_user_account_id": "บัญชี ID：%s",
    "sf_user_account_number": "บัญชี：%s",
    "sf_game_community_facebook": "Facebook",
    "sf_game_community_discord": "Discord",
    "sf_game_community_instagram": "Instagram",
    "sf_game_community_twitter": "Twitter",
    "sf_game_community_line": "LINE",
    "sf_login_title": "ล็อกอิน",
    "sf_login_with_huawei": "ล็อกอินด้วยบัญชี HUAWEI",
    "sf_login_with_google": "ล็อกอินด้วยบัญชี Google",
    "sf_login_with_games": "ล็อกอินด้วยบัญชี Play Games",
    "sf_login_with_facebook": "ล็อกอินด้วยบัญชี Facebook",
    "sf_login_with_visitor": "ล็อกอินในฐานะผู้เยี่ยมชม",
    "sf_login_with_email": "ล็อกอินด้วยบัญชีอีเมล",
    "sf_login_back_social": "ล็อกอินด้วยบัญชีอื่นๆ",
    "sf_login_back_email": "มีอีเมลอยู่แล้วใช่ไหม กลับสู่การเข้าสู่ระบบ",
    "sf_login_type_not_support": "ปัจจุบันยังไม่รองรับการเข้าสู่ระบบดังกล่าว",
    "sf_login_history_usual": "ทั่วไป",
    "sf_login_history_time": "ล็อกอินล่าสุด：%s",
    "sf_login_time_minute": "%dนาทีที่แล้ว",
    "sf_login_time_minutes": "%dนาทีที่แล้ว",
    "sf_login_time_hour": "%dชั่วโมงที่แล้ว",
    "sf_login_time_hours": "%dชั่วโมงที่แล้ว",
    "sf_login_time_day": "%dวันก่อน",
    "sf_login_time_days": "%dวันก่อน",
    "sf_login_other_types": "วิธีการเข้าสู่ระบบอื่น ๆ",
    "sf_email_login_title": "ล็อกอินด้วยอีเมล",
    "sf_email_signup_title": "ลงทะเบียนด้วยอีเมล",
    "sf_verify_countdown": "%d s",
    "sf_hint_account": "กรุณาสร้างชื่อบัญชีผู้ใช้ของคุณ (6–20 ตัว)",
    "sf_hint_account_check": "ชื่อบัญชีผู้ใช้ต้องมีความยาว (6–20 ตัว) สามารถประกอบไปด้วยตัวอักษรและตัวเลข",
    "sf_hint_account_empty": "โปรดป้อนบัญชีของท่าน",
    "sf_hint_email": "โปรดป้อนอีเมลของท่าน",
    "sf_hint_email_check": "รูปแบบอีเมลไม่ถูกต้อง",
    "sf_hint_password": "โปรดป้อนรหัสผ่าน (6–20 ตัว)",
    "sf_hint_password_new": "โปรดป้อนรหัสผ่านใหม ่(6–20 ตัว)",
    "sf_hint_password_check": "รหัสผ่านบัญชีผู้ใช้ต้องมีความยาว (6–20 ตัว) สามารถประกอบไปด้วยตัวอักษรและตัวเลข",
    "sf_hint_verify_code": "รหัสยืนยัน",
    "sf_hint_email_code": "โปรดป้อนรหัสยืนยันอีเมล",
    "sf_forget_account": "ลืมบัญชี",
    "sf_forget_password": "ลืมรหัสผ่าน",
    "sf_reset_password_back": "ยังไม่มีบัญชีใช่ไหม สมัครตอนนี้เลย",
    "sf_reset_password_title": "รีเซ็ตรหัสผ่าน",
    "sf_reset_password_desc": "โปรดป้อนชื่อบัญชีผู้ใช้และที่อยู่อีเมลของคุณเพื่อรีเซ็ตรหัสผ่าน",
    "sf_find_account_desc": "โปรดป้อนอีเมลที่เชื่อมโยงกับบัญชีของคุณเพื่อเรียกคืนบัญชี",
    "sf_find_account_tips": "โปรดดูแลบัญชีของคุณให้ดี เพื่อหลีกเลี่ยงการสูญหายข้อมูล",
    "sf_find_account_login": "คัดลอกบัญชีและเข้าสู่ระบบ",
    "sf_visitor_title": "ข้อแนะนำ",
    "sf_visitor_content": "ขณะนี้คุณเข้าสู่ระบบในฐานะผู้เยี่ยมชม เพื่อหลีกเลี่ยงการสูญเสียข้อมูลของเกม ขอแนะนำให้ท่านผูกบัญชีโดยเร็วที่สุด",
    "sf_visitor_btn_ignore": "ละเลย",
    "sf_email_bind_title": "ผูกบัญชีอีเมล",
    "sf_visitor_upgrade_btn": "ถัดไป",
    "sf_visitor_upgrade_cancel": "เลิกการเชื่อมโยงใช่ไหม ย้อนกลับ",
    "sf_paying_tip": "ขณะนี้มีการสั่งซื้อที่กำลังชำระเงิน โปรดลองอีกครั้งในภายหลัง",
    "sf_pay_checking": "กำลังตรวจสอบการชำระเงิน โปรดลองอีกครั้งในภายหลัง",
    "sf_pay_failed": "การชำระเงินล้มเหลว",
    "sf_owned_order_check": "ตรวจพบคำสั่งซื้อล่าสุดที่ต้องชำระยังไม่เสร็จสมบูรณ์ คุณต้องการดำเนินการตามคำสั่งซื้อที่คุณชำระต่อไปหรือไม่",
    "sf_owned_order_checked": "การชำระเงินเสร็จสมบูรณ์",
    "sf_owned_order_checked_failed": "การเรียกคืนคำสั่งซื้อล้มเหลว",
    "sf_pending_order_checked": "ตรวจพบว่าสถานะการซื้อสินค้านี้อยู่ในสถานะ \"รอดำเนินการ\"  แต่ทางเรายังไม่ได้รับการแจ้งเตือนสถานะการชำระเงินสำเร็จบนแพลตฟอร์ม Google หากคุณชำระเงินเสร็จสิ้นและหักเงินแล้ว อาจเกิดจากความล่าช้าของช่องทางการชำระเงินของบุคคลที่สาม โปรดอย่ากังวล ทางเราจะดำเนินการออกสินค้าที่เกี่ยวข้องให้กับคุณในภายหลังเมื่อเราได้รับการแจ้งเตือนการชำระเงินเสร็จสมบูรณ์บนแพลตฟอร์ม Google",
    "sf_pending_order_checked_normal": "เราได้รับการแจ้งเตือนสถานะการซื้อจากแพลตฟอร์ม Google แต่สถานะการซื้อของสินค้านี้อยู่ในสถานะ \"รอดำเนินการ\" ดังนั้นเราจึงไม่สามารถออกสินค้าให้กับคุณได้ชั่วคราว หากคุณชำระเงินเสร็จสิ้นและหักเงินแล้ว อาจเกิดจากความล่าช้าของช่องทางการชำระเงินของบุคคลที่สาม โปรดอย่ากังวล เราจะดำเนินออกสินค้าที่เกี่ยวข้องให้กับคุณในภายหลังเมื่อเราได้รับการแจ้งเตือนการชำระเงินสำเร็จบนแพลตฟอร์ม Google",
    "sf_email_not_empty": "โปรดป้อนบัญชีอีเมลของคุณ",
    "sf_password_not_empty": "โปรดป้อนรหัสผ่านของคุณ",
    "sf_code_not_empty": "โปรดป้อนรหัสยืนยันอีเมล",
    "sf_email_sent": "รหัสยืนยันอีเมลถูกส่งไปแล้ว",
    "sf_loading": "กำลังโหลด โปรดรอสักครู่",
    "sf_email_code_tip": "โปรดป้อนรหัสยืนยันที่เราส่งไปยังอีเมลของคุณ",
    "sf_register_failed": "ลงทะเบียนบัญชีล้มเหลว",
    "sf_reset_password_failed": "รีเซ็ตรหัสผ่านล้มเหลว",
    "sf_reset_password_success": "รีเซ็ตรหัสผ่านสำเร็จ โปรดเข้าสู่ระบบอีกครั้ง",
    "sf_link_failed": "การผูกบัญชีล้มเหลว",
    "sf_facebook_not_installed": "ไม่ได้ติดตั้งแอพ Facebook บนอุปกรณ์นี้ โปรดเลือกวิธีอื่นในการเข้าสู่ระบบ",
    "sf_create_order_failed": "การสร้างคำสั่งซื้อล้มเหลว",
    "sf_pay_closed": "ฟังก์ชันการชำระเงินถูกปิดแล้ว โปรดลองอีกครั้งในภายหลัง",
    "sf_update_title": "ข้อแนะนำการอัปเกรด",
    "sf_update_content_force": "เวอร์ชันใหม่[%s]เปิดให้บริการ \nเนื่องจากมีการแก้ไขและอัปเดตฟีเจอร์ใหม่ที่จำเป็น คุณสามารถเล่นเกมต่อได้หลังจากอัปเดตเป็นเวอร์ชันล่าสุดเท่านั้น",
    "sf_update_content": "เวอร์ชันใหม่[%s]เปิดให้บริการ  \nเพื่อสัมผัสประสบการณ์ฟีเจอร์ใหม่ๆ เราขอแนะนำให้คุณอัปเดตเป็นเวอร์ชันล่าสุด",
    "sf_update_ok": "อัปเกรดทันที",
    "sf_update_cancel": "ยกเลิก",
    "sf_update_url_error": "ข้อผิดพลาดของการอัปเกรด URL",
    "sf_web_location_tips": "%sต้องการใช้ข้อมูลตำแหน่งของอุปกรณ์ของคุณ",
    "sf_cancel_account_title": "การยกเลิกบัญชี",
    "sf_cancel_account_desc": "ฟังก์ชั่นการลบบัญชีจะต้องดำเนินการเมื่อตัวละครในเกมของคุณออฟไลน์ในปัจจุบัน หลังจากคลิกตกลง คุณจะออกจากระบบและไปที่การลบบัญชี คุณแน่ใจหรือไม่ว่าต้องการออกจากระบบและไปยังการลบบัญชี",
    "sf_cancel_account_warn_tips": "หากลบบัญชี ข้อมูลเกมจะถูกลบทั้งหมด โปรดดำเนินการด้วยความระมัดระวัง",
    "sf_account_protocol_prefix": "ฉันได้อ่านรายละเอียดและยอมรับ%s",
    "sf_account_protocol_check": "โปรดอ่านอย่างละเอียดและยอมรับ%s",
    "sf_cancel_account_protocol": "ข้อตกลงการยกเลิกบัญชีผู้ใช้",
    "sf_cancel_account_protocol_check": "โปรดยอมรับข้อตกลงของการยกเลิกบัญชีผู้ใช้ก่อน",
    "sf_cancel_account_conditions_title": "เงื่อนไขการยกเลิกบัญชีผู้ใช้",
    "sf_cancel_account_conditions_content": "ผู้เล่นที่รักทางเราเสียใจกับการยกเลิกบัญชีของคุณอย่างมาก  เพื่อรับรองบัญชีและทรัพย์สินของคุณให้มีความปลอดภัย โปรดตรวจสอบให้แน่ใจว่ามีเงื่อนไขต่อไปนี้ก่อนที่ใบสมัครยกเลิกที่คุณส่งมาจะมีผล ทีมงานเกมของเรายังมีสิทธิ์ตรวจสอบยืนยันตามสถานการณ์： \n1.บัญชีมีความปลอดภัย:บัญชีใช้งานได้ตามปกติไม่อยู่ในระยะเวลาการละเมิด（หมายความว่าบัญชีถูกแบนหรือมีการดำเนินการอื่น ๆ เนื่องจากการละเมิดข้อตกลงและกฎที่เกี่ยวข้องของเกม）และไม่มีความเสี่ยงที่จะถูกขโมยหรือบล็อค\n2.รายได้จากเกมได้รับการตัดสินหรือจัดการอย่างเหมาะสมแล้ว รวมถึงแต่ไม่จำกัดเพียงโทเค็นเกม อุปกรณ์ประกอบฉากเสมือนจริงของเกม และบริการเสริมอื่นๆ ของเกม（ต่อไปนี้จะเรียกรวมกันว่า \"รายได้ของเกม\"）โปรดจัดการให้เรียบร้อย หากไม่ได้การจัดการจะถือว่าคุณสละรายได้ของเกมโดยสมัครใจ\n3. บัญชีไม่มีคำสั่งซื้อคงค้าง：รวมถึงการชาร์จโทเค็นเกม การซื้ออุปกรณ์ประกอบฉากเสมือนของเกมอื่น ๆ และผลิตภัณฑ์ต่อพ่วงอื่น ๆ เป็นต้น \n4.หากมีฐานะเป็นผู้สร้างชุมชนในเกม ความสัมพันธ์ที่ใกล้ชิดและการปฏิสัมพันธ์อื่น ๆ:โปรดตรวจสอบให้แน่ใจว่าความสัมพันธ์ทางสังคมเหล่านี้สิ้นสุดลงแล้ว หากมีฐานะเป็นผู้สร้างชุมชนในเกม คุณต้องลบฐานะผู้สร้างออก\n5.  บัญชีไม่มีข้อพิพาทใด ๆ ：รวมถึงข้อร้องเรียนและรายงาน ข้อถูกร้องเรียนและรายงาน การอนุญาโตตุลาการ การดำเนินคดี และข้อพิพาทอื่น ๆ",
    "sf_cancel_account_conditions_meet": "ฉันปฏิบัติตามเงื่อนไขการยกเลิกข้างต้นแล้ว",
    "sf_cancel_account_agreement_title": "ข้อตกลงการยกเลิกบัญชีผู้ใช้",
    "sf_cancel_account_agreement_content": "ผู้เล่นที่รัก ก่อนที่คุณจะเริ่มขั้นตอนต่อไปของกระบวนการลบบัญชีผู้ใช้อย่างเป็นทางการ โปรดอย่าลืมอ่านและยอมรับ \"ข้อตกลงการยกเลิกบัญชีเกม\" โดยละเอียด （ต่อไปนี้จะเรียกว่า \"ข้อตกลงนี้\"）เมื่อคุณตรวจสอบข้อตกลงนี้และคลิกถัดไป จะถือว่าคุณตกลงและปฏิบัติตามเนื้อหาทั้งหมดของข้อตกลง ทางเราขอเตือนคุณผู้เล่นอย่างเป็นพิเศษ：\n หากคุณส่งใบสมัครยกเลิกบัญชีของคุณสำเร็จ เราจะเก็บบัญชีของคุณไว้เป็นเวลา 15 วัน นับจากวันถัดไปจากที่คุณส่งใบสมัครยกเลิกบัญชีของคุณ ในช่วงเวลานี้ เราจะไม่ลบข้อมูลที่เกี่ยวข้องของบัญชีนี้ในขณะนี้（เช่นเพื่อนของคุณยังคงเห็นอวาตาร์ ชื่อเล่น และข้อมูลบัญชีอื่น ๆ ของคุณ）หากคุณใช้บัญชีนี้เพื่อเข้าสู่เกมนี้ในช่วงเวลานี้จะถือว่าคุณได้ยกเลิกใบสมัครยกเลิกบัญชีของคุณแล้ว หลังจากนี้เราจะดำเนินการยกเลิกบัญชีให้เสร็จสิ้น และลบหรือปิดบังข้อมูลส่วนบุคคลที่เกี่ยวข้องของคุณ \nหลังจากยกเลิกบัญชีเกมนี้ เว้นแต่กฎหมายข้อบังคับ และข้อตกลงนี้จะระบุไว้เป็นอย่างอื่น บัญชีเกมของคุณจะถูกลบหรือปิดบังข้อมูล และคุณจะไม่สามารถค้นหา เข้าถึง รับ ใช้งานหรือเรียกคืนได้ต่อไปอีก และคุณจะไม่มีสิทธิ์ขอให้เรียกคืนข้อมูลส่วนบุคคล ข้อมูลส่วนบุคคลที่กล่าวมาข้างต้นรวมถึงแต่ไม่จำกัด เฉพาะ: อวตาร์ ชื่อเล่น อุปกรณ์ประกอบฉากเสมือนจริงของเกมทั้งหมดที่ซื้อหรือได้รับในเกมและบริการเสริมอื่น ๆ สุนทรพจน์ ภูมิภาค บันทึกการสนทนาในเกม ฯลฯ\n สำหรับข้อควรระวังและกฎรายละเอียดอื่นๆ เกี่ยวกับการยกเลิกบัญชีเกม โปรดคลิกเพื่อดู \"ข้อตกลงการยกเลิกบัญชีผู้ใช้\"",
    "sf_cancel_account_protocol_title": "ข้อตกลงการยกเลิกบัญชี",
    "sf_cancel_account_protocol_content": "ก่อนที่คุณจะยกเลิกบัญชีของคุณ โปรดอ่าน ทำความเข้าใจ และยอมรับในเรื่องต่อไปนี้ให้ครบถ้วน：\n【คำเตือนพิเศษ】การยกเลิกบัญชีนี้สำเร็จเป็นการดำเนินการที่ไม่สามารถย้อนกลับได้ หลังจากยกเลิกบัญชีของคุณ คุณจะไม่สามารถใช้บัญชีนี้ได้อีกต่อไปและเรียกคืนเนื้อหาหรือข้อมูลที่เกี่ยวข้องกับเกมที่คุณเรียกดูหรือผูกเชื่อม（แม้ว่าคุณจะใช้หมายเลขโทรศัพท์มือถือ อีเมล หรือบัญชีบุคคลที่สามอื่นๆในการลงทะเบียนและใช้งานอีกครั้งก็ตาม）\nขอแนะนำให้คุณสำรองข้อมูลทั้งหมดที่เกี่ยวข้องกับบัญชีของคุณก่อนการยกเลิก และโปรดยืนยันว่าบริการทั้งหมดที่เกี่ยวข้องกับบัญชีนี้ได้รับการจัดการอย่างเรียบร้อย หลังจากการยกเลิกเสร็จสิ้น เราจะลบหรือทำให้ข้อมูลส่วนบุคคลของคุณเป็นนิรนาม (เว้นแต่กฎหมายและข้อบังคับจะกำหนดไว้เป็นอย่างอื่น)\\เราเสียใจอย่างยิ่งที่คุณตัดสินใจยกเลิกบัญชีของคุณ หากคุณยังคงตัดสินใจยกเลิกบัญชีของคุณต่อไป บัญชีของคุณจะต้องตรงตามเงื่อนไขต่อไปนี้:\n1.บัญชีอยู่ในสถานะที่ปลอดภัย: บัญชีมีการใช้งานตามปกติและไม่มีความเสี่ยงที่จะถูกขโมยหลังจากการตรวจสอบความปลอดภัยของแพลตฟอร์ม\n2.ทรัพย์สินของบัญชีได้รับการชำระบัญชีแล้ว และไม่มีบริการที่ยังไม่เสร็จสิ้นหรือมีข้อโต้แย้ง: ไม่มีสินทรัพย์ค้างชำระ เงินที่ยังไม่ได้ชำระ และสิทธิ์เสมือนในบัญชี；บัญชีนี้และบุคคลที่สามที่เข้าถึงได้ผ่านบัญชีนี้ไม่มีบริการที่ยังไม่เสร็จสิ้นหรือมีข้อโต้แย้ง\n3.บัญชีถูกปลดจากการเข้าสู่ระบบที่ได้รับอนุญาตหรือความสัมพันธ์ที่มีผลผูกพันกับผลิตภัณฑ์และหน้าเว็บของบุคคลที่สาม\n4.บัญชีไม่มีข้อพิพาทค้างชำระ รวมถึงการร้องเรียนและรายงานหรือข้อถูกร้องเรียนและรายงาน\nหลังจากที่บัญชีถูกยกเลิก คุณจะไม่สามารถเข้าสู่ระบบหรือใช้บัญชีนี้ และไม่สามารถดึงเนื้อหาหรือข้อมูลใด ๆ ในบัญชีนี้หรือที่เกี่ยวข้องกับบัญชีได้ รวมถึงแต่ไม่จำกัดเพียง:\n1.ข้อมูลประจำตัวที่บุคคลนั้นได้ส่งมา ข้อมูลบัญชี ข้อมูลที่เกี่ยวข้องกับเกม และข้อมูลอื่น ๆ\n2.บันทึกที่เกี่ยวข้องกับบริการของบุคคลที่สามที่ใช้ผ่านบัญชีนี้และใช้หลังจากเข้าสู่ระบบที่ได้รับอนุญาตหรือผูกบัญชีนี้จะไม่สามารถเรียกคืน คุณจะไม่สามารถเข้าสู่ระบบหรือใช้บริการข้างต้นได้อีกต่อไป และผลประโยชน์ในทรัพย์สินใด ๆ เช่น ทรัพย์สินหรือสิทธิ์เสมือนและผลประโยชน์ที่ได้รับผ่านบริการข้างต้นจะถือเป็นความยินยอมของคุณ จะไม่สามารถใช้ได้อีกต่อไป คุณเข้าใจและยอมรับ เราจะไม่สามารถช่วยเหลือคุณในการคืนสถานะบริการข้างต้นได้\n3.ยอดคงเหลือในบัญชีกระเป๋าสตางค์ รางวัล รายได้ ข้อมูลการตรวจสอบชื่อจริง บันทึกการทำธุรกรรม บัตรธนาคารที่ถูกผูกไว้ และข้อมูลอื่น ๆ ในบัญชีจะถูกใช้งานและถูกลบทิ้ง\\การยกเลิกบัญชีจะทำให้เราต้องยุติบริการของเราสำหรับคุณ ซึ่งจะถูกยกเลิกตามสิทธิ์และภาระผูกพันของทั้งสองฝ่ายที่กำหนดไว้ใน \"ข้อตกลงการบริการผู้ใช้\" และ \"นโยบายความเป็นส่วนตัว\" ของเกม\n4.ในช่วงระยะเวลาของการยกเลิกบัญชีของคุณ หากบัญชีของคุณเกี่ยวข้องกับข้อพิพาท รวมถึงแต่ไม่จำกัดเพียง: การร้องเรียน รายงาน การดำเนินคดี อนุญาโตตุลาการ การสืบสวนโดยหน่วยงานของรัฐ ฯลฯ คุณเข้าใจและยอมรับ ทางเราจะมีสิทธิ์ตัดสินใจตามดุลยพินิจเองว่าจะยกเลิกบัญชีนี้โดยไม่ได้รับความยินยอมจากคุณหรือไม่\n5.การยกเลิกบัญชีไม่ได้หมายความว่าพฤติกรรมของบัญชีและความรับผิดชอบที่เกี่ยวข้องก่อนที่บัญชีจะถูกยกเลิกจะได้รับการอภัยหรือบรรเทาลง",
    "sf_cancel_account_agreement_agree": "ฉันได้อ่านรายละเอียดและยอมรับ%sแล้ว",
    "sf_cancel_account_notice_title": "การแจ้งเตือนการยกเลิก",
    "sf_cancel_account_notice_content": "เพื่อป้องกันการดำเนินการที่ไม่ถูกต้อง โปรดยืนยันอีกครั้งว่าจะยกเลิกบัญชีหรือไม่และยืนยันผลกระทบของการยกเลิก ผลกระทบนี้รวมถึงแต่ไม่จำกัดเพียง (สำหรับรายละเอียด โปรดดูที่ \"ข้อตกลงการยกเลิกบัญชีเกม\")\n1.เมื่อบัญชีนี้ถูกยกเลิกแล้ว คุณจะไม่สามารถเข้าสู่ระบบหรือใช้บัญชีนี้ได้ และไม่สามารถคืนได้ เว้นแต่กฎหมายและข้อบังคับหรือข้อตกลงการยกเลิกบัญชีเกมจะกำหนดไว้เป็นอย่างอื่น ข้อมูลส่วนบุคคลภายใต้บัญชีเกมจะถูกลบหรือจัดการโดยไม่เปิดเผยตัวตน คุณจะไม่สามารถเรียกคืนข้อมูลส่วนบุคคลของคุณได้อีกต่อไป และคุณไม่มีสิทธิ์ขอให้เรียกคืนข้อมูลดังกล่าว\n2.เมื่อบัญชีถูกยกเลิก โทเค็นเกม อุปกรณ์ประกอบฉากเสมือนของเกมอื่น ๆ และบริการเสริมอื่น ๆ (ต่อไปนี้จะเรียกว่า \"รายได้ของเกม\") ภายใต้บัญชีก็จะถูกล้างเช่นกัน ดังนั้น เราขอเตือนคุณด้วยว่าก่อนที่คุณจะยกเลิกบัญชีเกมนี้ โปรดตรวจสอบให้แน่ใจว่ารายได้เกมภายใต้บัญชีเกมได้รับการจัดการอย่างเรียบร้อย หรือรายได้เกมที่เกี่ยวข้องได้รับการชำระแล้ว เมื่อคุณยกเลิกบัญชีเกมนี้ จะถือว่าคุณสละรายได้เกมโดยยินยอม เรามีสิทธิ์จัดการรายได้ทั้งหมดภายใต้บัญชีเกมอย่างชัดเจน และคุณจะต้องรับผิดชอบต่อผลที่ตามมา",
    "sf_cancel_account_notice_giveup": "ยอมแพ้",
    "sf_cancel_account_notice_agree": "ยินยอมที่จะยกเลิก",
    "sf_cancel_account_success_title": "ส่งใบสมัครยกเลิกสำเร็จแล้ว",
    "sf_cancel_account_success_content": "ขอบคุณสำหรับการสนับสนุนของเกมนี้ บัญชีของคุณได้ตรวจสอบเงื่อนไขการยกเลิกใน %1$s และส่งใบสมัครยกเลิกเรียบร้อยแล้ว ยกเว้นสถานการณ์ที่กำหนดโดยกฎหมายและข้อบังคับและข้อตกลงการยกเลิก เราจะเก็บบัญชีไว้ให้คุณถึง%2$s (15 วันที่นับจากวันถัดไปจากที่คุณส่งใบสมัครยกเลิก) หลังจากนี้ หากการสมัครยกเลิกบัญชีสำเร็จ เราจะลบหรือไม่เปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวข้องของคุณ<br><br><font color=\"#ff4332\">ก่อนครบกำหนด 15 วันข้างต้น โปรดอย่าเข้าสู่ระบบและใช้บัญชีนี้เพื่อให้แน่ใจว่าการยกเลิกจะเสร็จสมบูรณ์อย่างราบรื่น มิฉะนั้นจะถือว่าคุณได้ยกเลิกใบสมัครยกเลิกของคุณแล้ว</font>",
    "sf_refund_warning_tips": "ผู้เล่นที่รัก ระบบรับรู้ว่ามีการคืนเงินในบัญชีของคุณ ตามข้อตกลงผู้ใช้ของเรา การคืนเงินถือเป็นการละเมิดอย่างร้ายแรง หากตรวจสอบได้ว่าคุณมีการคืนเงินหลายครั้ง บัญชีของคุณจะถูกแบนอย่างถาวร",
    "sf_account_unbind_disallow_tips": "โปรดอัปเกรดบัญชีให้เสร็จสิ้นหรือผูกบัญชีอื่นก่อนที่จะยกเลิกการผูก",
    "sf_question_instruction": "คำแนะนำแบบสอบถาม",
    "sf_question_select_role": "โปรดเลือกตัวละคร",
    "sf_question_select_server": "โปรดเลือกเซิร์ฟเวอร์",
    "sf_question_check_undone": "มีคำถามยังไม่ได้รับคำตอบ โปรดทำให้เสร็จสิ้นก่อนส่ง",
    "sf_question_action_start": "เริ่มตอบคำถาม",
    "sf_question_action_submit": "ส่งแบบสอบถาม",
    "sf_question_action_receive": "รับ",
    "sf_question_action_return": "กลับไปยังเกม",
    "sf_question_state_over": "กิจกรรมนี้สิ้นสุดแล้ว",
    "sf_order_id": "หมายเลขคำสั่งซื้อ",
    "sf_order_server": "เซิร์ฟเวอร์",
    "sf_order_role": "ตัวละคร",
    "sf_order_amount": "จำนวนการเติมเงิน",
    "sf_order_empty": "ไม่มีบันทึกการสั่งซื้อ",
    "sf_gift_exchange": "วิธีการแลก：%s",
    "sf_gift_receive_success": "รับเรียบร้อยแล้ว",
    "sf_gift_receive_failed": "รับล้มเหลว",
    "sf_error_domain_failed": "ไม่พบชื่อโดเมนดังกล่าว",
    "sf_error_parse_failed": "การแยกวิเคราะห์ข้อมูลล้มเหลว",
    "sf_error_network_error": "ขณะนี้ไม่สามารถเชื่อมต่ออินเทอร์เน็ตได้ โปรดตรวจสอบการตั้งค่าเครือข่ายของคุณ",
    "sf_error_data_exception": "ข้อมูลมีความผิดปกติ โปรดลองอีกครั้งในภายหลัง",
    "sf_error_params_invalid": "พารามิเตอร์ไม่ถูกต้อง โปรดตรวจสอบและลองอีกครั้ง",
    "sf_error_login_closed": "ฟังก์ชั่นการเข้าสู่ระบบถูกปิดแล้ว โปรดลองอีกครั้งในภายหลัง",
    "sf_error_login_canceled": "การเข้าสู่ระบบถูกยกเลิก",
    "sf_error_1001": "ไม่พบเกมดังกล่าว",
    "sf_error_1002": "บัญชีหรือรหัสผ่านไม่ถูกต้อง",
    "sf_error_1003": "ผู้ใช้รายนี้ถูกแบน",
    "sf_error_1004": "การเข้าสู่ระบบของผู้เยี่ยมชมถูกปิด",
    "sf_error_1005": "จำนวนการเข้าสู่ระบบของผู้เยี่ยมชมถึงขีดจำกัดสูงสุดแล้ว",
    "sf_error_1006": "การเข้าสู่ระบบล้มเหลว",
    "sf_error_1007": "ไม่พบชื่อที่อยู่อีเมลดังกล่าว",
    "sf_error_1008": "ที่อยู่อีเมลมีการใช้งานแล้ว",
    "sf_error_1009": "รหัสยืนยันไม่ถูกต้องหรือหมดอายุ",
    "sf_error_1010": "การผูกที่อยู่อีเมลล้มเหลว",
    "sf_error_1011": "บัญชีนี้ถูกใช้แล้ว",
    "sf_error_1012": "การผูกบัญชีล้มเหลว",
    "sf_error_1013": "ฟังก์ชั่นเติมเงินเกมถูกปิดแล้ว",
    "sf_error_1014": "ไม่พบสินค้าในเกมดังกล่าว",
    "sf_error_1015": "ราคาไอเท็มเกมดังกล่าวไม่ถูกต้อง",
    "sf_error_1016": "ไม่พบรายการสั่งซื้อดังกล่าว",
    "sf_error_1017": "การยืนยันคำสั่งซื้อล้มเหลว",
    "sf_error_1018": "กรุณารอการตรวจสอบ",
    "sf_error_1019": "ช่วงเวลาระหว่างการส่งคำขอยกเลิกสมัครสองครั้งจะต้องห่างกันมากกว่า 3 วัน",
    "sf_error_1020": "มีคำสั่งซื้อที่กำลังดำเนินการอยู่ในบัญชีของคุณ และคุณจะไม่สามารถขอยกเลิกบัญชีได้ในขณะนี้",
    "sf_error_1023": "ผู้เล่นที่รัก บัญชีของคุณถูกแบนเนื่องจากพฤติกรรมการคืนเงินความถี่สูง หากคุณต้องการปลดบล็อก โปรดคลิกปุ่มด้านล่างเพื่อติดต่อฝ่ายบริการลูกค้าอย่างเป็นทางการของเรา",
    "sf_error_1028": "บัญชีนี้ยังไม่ได้ลงทะเบียน คุณต้องการลงทะเบียนบัญชีนี้หรือไม่",
    "sf_error_1029": "บัญชีนี้มีตัวละครในเกมอยู่แล้วและไม่สามารถผูกได้ โปรดเปลี่ยนบัญชี",
    "sf_error_1030": "บัญชีนี้ยังไม่ได้ลงทะเบียน คุณต้องการลงทะเบียนบัญชีนี้แล้วใช้บัญชีนี้เพื่ออัปเกรดหรือไม่",
    "sf_error_1031": "การยกเลิกผูกเชื่อมล้มเหลว",
    "sf_error_1032": "ไม่พบชื่อบัญชีดังกล่าว",
    "sf_error_2000": "การชำระเงินสำเร็จ",
    "sf_error_2001": "การชำระเงินล้มเหลว",
    "sf_error_2002": "หมดเวลาการเชื่อมต่อบริการ Google Play",
    "sf_error_2003": "play store บนอุปกรณ์ปัจจุบันไม่รองรับฟีเจอร์ที่ร้องขอ",
    "sf_error_2004": "ไม่ได้เชื่อมต่อบริการ Google Play",
    "sf_error_2005": "ธุรกรรมถูกยกเลิกโดยผู้ใช้",
    "sf_error_2006": "บริการของ Google ไม่พร้อมใช้งาน",
    "sf_error_2007": "เกิดข้อผิดพลาดในการเรียกเก็บเงินของผู้ใช้ระหว่างการประมวลผล",
    "sf_error_2008": "ไม่สามารถซื้อสินค้าที่ร้องขอได้",
    "sf_error_2009": "ข้อผิดพลาดระหว่างการทำงานของ API",
    "sf_error_2010": "ข้อผิดพลาดที่เกิดจากการใช้ API ไม่ถูกต้อง",
    "sf_error_2011": "การซื้อล้มเหลวเนื่องจากมีสินค้าอยู่แล้ว",
    "sf_error_2012": "การดำเนินการรายการที่ร้องขอล้มเหลวเนื่องจากไม่ได้เป็นเจ้าของโดยผู้ใช้",
    "sf_error_2013": "ไม่พบข้อมูลการสั่งซื้อการลงทะเบียนล่วงหน้า",
    "other": {
        "no_other_login_history_currently": "ไม่มีข้อมูลการล็อกอินทางประวัติศาสตร์อื่น ๆ",
        "questionnaire_completed": "กรอกแบบสอบถาม",
        "submitted_successfully": "ส่งสำเร็จแล้ว",
        "logout_success": "ที่จะออกจากระบบ",
        "unbind_facebook": "แก้มัด Facebook",
        "unbind_google": "แก้มัด Google",
        "last_login_time": "เวลาล็อกอินล่าสุด",
        "sf_cancel_account_success_content_1": "　　ขอบคุณสำหรับการสนับสนุนของเกมนี้ บัญชีของคุณได้ตรวจสอบเงื่อนไขการยกเลิกใน",
        "sf_cancel_account_success_content_2": "และส่งใบสมัครยกเลิกเรียบร้อยแล้ว ยกเว้นสถานการณ์ที่กำหนดโดยกฎหมายและข้อบังคับและข้อตกลงการยกเลิก เราจะเก็บบัญชีไว้ให้คุณถึง",
        "sf_cancel_account_success_content_3": "(15 วันที่นับจากวันถัดไปจากที่คุณส่งใบสมัครยกเลิก) หลังจากนี้ หากการสมัครยกเลิกบัญชีสำเร็จ เราจะลบหรือไม่เปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวข้องของคุณ<br><br><font color=\"#ff4332\">ก่อนครบกำหนด 15 วันข้างต้น โปรดอย่าเข้าสู่ระบบและใช้บัญชีนี้เพื่อให้แน่ใจว่าการยกเลิกจะเสร็จสมบูรณ์อย่างราบรื่น มิฉะนั้นจะถือว่าคุณได้ยกเลิกใบสมัครยกเลิกของคุณแล้ว</font>",
        "sf_and_joiner": " และ ",
        "showMoney": "จำนวนเงิน ที่จ่าย",
        "TH": "ประเทศไทย",
        "SG": "สิงคโปร์",
        "MY": "มาเลเซีย",
        "PH": "ฟิลิปปินส์",
        "ID": "อินโดนีเซีย",
        "VN": "เวียตนาม",
        "HK": "ฮ่องกง",
        "TW": "ไต้หวัน",
        "MO": "มาเก๊า",
        "US": "อเมริกา",
        "CA": "แคนาดາ",
        "AU": "ออสเตรเลีย",
        "GB": "สหราชอาณาจักร",
        "FR": "ฝรั່ງเศส",
        "DE": "เยอรมັນ",
        "submit_pay": "ยืนยันการชำระเงิน",
        "select_country_list": "โปรดเลือกประเทศ",
        "select_country": "สลับไปยังช่องประเทศอื่น (ไม่บังคับ)",
        "pay_dialog_text": "การชำระเงินยังไม่เสร็จสิ้นโปรดยืนยันว่า คุณจะถอนตัว หรือไม่?",
        "pay_quit_text": "ยืนยันการออก",
        "pay_continue_text": "จ่ายต่อไปค่ะ",
        "sf_link_with_apple": "ผูกบัญชี Apple",
        "sf_link_done_apple": "บัญชี Apple ที่ถูกผูกไว้",
        "sf_third_cancel": "ยกเลิก"
    }
}